src/cf/Documents/ВыдачаНаличных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыдачаНаличных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ДенежныеСредстваВКассах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКассах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Documents/ВыдачаНаличных/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Сумма <= 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сумма выдачи должна быть больше нуля.";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Движения.ДенежныеСредстваВКассах.Записывать = Истина;
	
	Движение = Движения.ДенежныеСредстваВКассах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Касса = Касса;
	Движение.Сумма = Сумма;
	Движения.ДенежныеСредстваВКассах.БлокироватьДляИзменения = Истина;
	
	Движения.Записать();
	
	ПроверитьОстатокКассы(Отказ);
	
КонецПроцедуры   

Функция РассчитатьДефицитКассы()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   -Остатки.СуммаОстаток КАК Дефицит
	|ИЗ
	|   РегистрНакопления.ДенежныеСредстваВКассах.Остатки(
	|       &МоментВремени,
	|       Касса = &Касса) КАК Остатки
	|ГДЕ
	|   Остатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Дефицит;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Процедура ПроверитьОстатокКассы(Отказ)
	
	Дефицит = РассчитатьДефицитКассы();
	
	Если Дефицит = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РезультатКонтроля", Новый Структура("Код, Дефицит","НедостаточноСредств", Дефицит));
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст =
	"Недостаточно денежных средств в кассе. "
	+ "Не хватает " + Формат(Дефицит, "ЧДЦ=2") + " руб.";
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры
